{"sections":{"collection-image":{"type":"collection-image","settings":{}},"breadcrumbs":{"type":"breadcrumbs","settings":{}},"main":{"type":"collection-template","settings":{"collection_tags_enable":false,"collection_tags_count":true,"collection_multiple_tags_filtering_enable":false,"collection_sort_enable":true,"tag_selector":"button","collection_layout":"grid","rows":"10","desktop_grid":"4","mobile_grid":"2"}},"f05d206c-5f4f-4906-bbf8-84405adce0f1":{"type":"featured-content","settings":{"show_on_desktop":true,"show_on_mobile":true,"title":"ECO FRIENDLY PARTY BAGS UK","text":"<p>Our eco party bags are made from environmentally friendly materials. Say goodbye to plastic bags that pollute the planet and harm marine life. Our bags are made from renewable resources that leave a minimal impact on the environment. You can feel good about using our eco party bags at your next party knowing that you are doing your part to protect the planet.<\/p><p><\/p><p><strong>OUR MISSION TOWARDS A SUSTAINABLE FUTURE<\/strong><\/p><p>At KidsPartyCraft we are on a mission to become more sustainable and reduce our plastic waste. We have sourced a wide range of eco party supplies to cater for the growing concerns of parents accross the UK. In addition to this, All of our orders are sent with 100% sustainable packaging, using environmentally friendly and recyclable materials right down to the tape. We want to do our bit towards helping the environment and applying ethical standards accross our business to ensure a better future for our children and planet.<\/p><p>Support our mission with the best environmentally friendly goodies. Shop now and make a difference to the planet! Let's make every party a green one.<\/p><p><\/p><p><strong>WHAT ARE ECO PARTY BAGS?<\/strong><\/p><p>Eco party bags are an alternative to traditional party bags that are often made with single-use materials. Eco friendly party bags are plastic free, made from sustainable materials and are designed to be reused multiple times or to be recycled. They are often available in a range of sizes, shapes, and colors, making them the perfect choice for any occasion.<\/p><p><\/p><p><strong>OUR ECO PARTY BAGS<\/strong><\/p><p>Our eco friendly party bags are made from high quality, plastic free and sustainable materials at affordable prices. Whether you're planning a birthday party, a baby shower, or a wedding, our party bags are the perfect accessory to add a pop of color and style to your celebration.<\/p><p><\/p><ul><li>Plastic Free<\/li><li>Sustainable Materials<\/li><li>Recyclable<\/li><\/ul><p><\/p><p><strong>STYLISH<\/strong><\/p><p>Who says that eco-friendly can't be stylish? Our bags come in a variety of popular children's themes and designs that are sure to impress your guests. From bold patterns to bright colors, our bags are the perfect accessory for any party theme. Not only do they look great, but they are also functional and durable, able to hold all of your party favors and treats.<\/p><p><\/p><p><strong>VERASTILE<\/strong><br\/>Our eco party bags are not just for parties. They are versatile and can be used for a variety of occasions. Our bags are an eco-friendly alternative to traditional paper or plastic bags, making them a practical choice for anyone looking to reduce their carbon footprint.<\/p><p><\/p><p><strong>AFFORDABLE<\/strong><\/p><p>Our range of eco party bags are the perfect choice for a sustainable and budget friendly party. We stock a huge range of affordable eco party bag & favors to suit any age & interest.<\/p><p><\/p><p><strong>COMBINE YOUR PARTY BAGS WITH OUR ECO FRIENDLY PARTY BAG FILLERS<\/strong><\/p><p>Make your party unforgettable with our eco-friendly party bag fillers. These products not only make great party favors, but they also serve as a reminder to your guests that you care about the environment. By incorporating sustainable products into your celebration, you can inspire others to do the same and promote a more sustainable lifestyle.<\/p><p><\/p><p>Our eco-friendly party bag fillers are fun and affordable. We offer a wide range of great party bag filler options guaranteed to go down a hit!<\/p><p><\/p><p>ECO FRIENDLY FILLER IDEAS:<\/p><ul><li>Eco Scratch Art Sets<\/li><li>Paper Puzzle Books<\/li><li>Wooden Pencils<\/li><li>Mini Paper Notebooks<\/li><li>Eco Colouring Sets<\/li><li>Wooden Jigsaw Puzzles<\/li><\/ul><p>+ More<\/p><p><\/p><p><strong>SHOP ECO PARTY BAGS UK WITH KIDS PARTY CRAFT<\/strong><\/p><p>Now you have some inspiration for you eco friendly party favors and bags, you can begin the party planning process by browsing all our eco friendly party supplies on our online store all at unbeaten prices.<\/p><p><\/p><p><strong>KIDSPARTYCRAFT - THE UK'S MOST TRUSTED KIDS PARTY SUPPLIES STORE!<\/strong><\/p>","section_style":"section-blank","text_size":"large","text_alignment":"","button_style":"btn--primary","button_label":"","button_link":""}}},"order":["collection-image","breadcrumbs","main","f05d206c-5f4f-4906-bbf8-84405adce0f1"]}