{"sections":{"collection-image":{"type":"collection-image","settings":{}},"breadcrumbs":{"type":"breadcrumbs","settings":{}},"5bdd708d-325c-4bc6-8a22-7615d6c613f1":{"type":"featured-collections","blocks":{"template--16675621273823__5bdd708d-325c-4bc6-8a22-7615d6c613f1-1675879793863e0c02-0":{"type":"collection","settings":{"title":"","collection":"boys-party-bag-fillers"}},"template--16675621273823__5bdd708d-325c-4bc6-8a22-7615d6c613f1-1675879793863e0c02-1":{"type":"collection","settings":{"title":"","collection":"girls-party-bag-fillers"}},"2bcbf489-e838-44eb-85bb-d3f6fde6abd8":{"type":"collection","settings":{"title":"","collection":"eco-party-bag-fillers"}}},"block_order":["template--16675621273823__5bdd708d-325c-4bc6-8a22-7615d6c613f1-1675879793863e0c02-0","template--16675621273823__5bdd708d-325c-4bc6-8a22-7615d6c613f1-1675879793863e0c02-1","2bcbf489-e838-44eb-85bb-d3f6fde6abd8"],"settings":{"show_on_desktop":true,"show_on_mobile":true,"full_width":false,"title":"","subtitle":"","section_style":"section-blank","section_height":"xsmall","show_view_all":false,"button_label":"View all","button_link":"shopify:\/\/collections","button_style":"btn--primary","slider_featured_collections":true,"arrows":true,"dots":true}},"main":{"type":"collection-template","settings":{"collection_tags_enable":false,"collection_tags_count":true,"collection_multiple_tags_filtering_enable":false,"collection_sort_enable":true,"tag_selector":"button","collection_layout":"grid","rows":"10","desktop_grid":"4","mobile_grid":"2"}},"59949bf2-c225-4674-a47e-fe58def4ed54":{"type":"featured-content","settings":{"show_on_desktop":true,"show_on_mobile":true,"title":"KIDS PARTY BAG FILLERS","text":"<p>Are you looking for cheap party bag goodies to make your event extra special? Look no further! At KidsPartyCraft we offer a huge range of fillers & favours in a variety of themes, designs and activity types perfect for any celebration. Our products will delight your little guests and leave them with lasting memories.<\/p><p><\/p><p>Shopping for all your party needs has never been easier with the KidsPartyCraft store. Just select from the menu what you're looking for and be directed to huge ranges of amazing children's party supplies & products.<\/p><p><\/p><p><strong>WHAT TO PUT IN PARTY BAGS?<\/strong><\/p><p>Throwing a party is always a fun and exciting experience, but it can also be stressful when it comes to figuring out what to put in party bags. The party bags, or goodie bags, are a great way to thank your guests for coming and to send them home with something to remember the occasion. The key is to make the party bags fun & memorable. It's also important to consider the age of your guests and match the general party theme. Our online store has a huge range of fillers to suit any celebration.<\/p><p>Top things to consider when choosing what to put in your party bags:<\/p><ul><li>Consider the age of your guests: Children of different ages have different interests and needs, so it's important to choose things that are appropriate for their age group. For example, younger children may enjoy simple toys, while older children may prefer more complex games.<\/li><\/ul><p><\/p><ul><li>Consider the theme of your party: If your party has a specific theme, choose things that are related to that theme. This will help to create a cohesive and memorable experience for the children.<\/li><\/ul><p><\/p><ul><li>Consider your budget: Fillers & favours can range in price, so it's important to choose things that fit within your budget. Keep in mind that you don't have to spend a lot of money to provide a great experience for your guests. Our store has thousands of cheap party supplies to ensure you can get everything you need without breaking the bank.<\/li><\/ul><p><\/p><p><strong>OUR PARTY BAGS<\/strong><\/p><p>You can shop party bags at KidsPartyCraft. We have a huge range of party bags, food boxes, loot bags, gift bags, pre-filled party bags & boxes and more all on our online store at guaranteed low prices. We stock a variety of party bag types in a diverse range of children's party themes & favourite characters. You can be sure to match your themed fillers with our themed party bags.<\/p><p>WE STOCK:<\/p><ul><li>Paper Party Bags<\/li><li>Themed Party Bags & Boxes<\/li><li>Colour Theme Party Bags & Boxes<\/li><li>Food Boxes<\/li><li>Loot Bags<\/li><li>Gift Bags<\/li><li>Cello Bags<\/li><li>Treat Bags<\/li><li>Pre-Filled Party Bags & Boxes<\/li><\/ul><p>Find any type of party bag in any theme, colour & design at KidsPartyCraft.<\/p><p><strong>CHEAP PARTY BAG FILLERS<\/strong><\/p><p>We have something for everyone! Regardless of your budget! Our cheap fillers & favours range from party bag toys, games, puzzles, stickers, stationery, novelties, goodies and more! At Kids Party Craft we guarantee to have something for all ages and at the lowest prices in the UK.<\/p><p><\/p><p><strong>BEST SELLING PARTY BAG FILLERS<\/strong><\/p><p>Ensure your party is a hit with our best selling bag fillers proven to provide a fun & entertaning experience for kids.<\/p><p>OUR BEST SELLING FILLERS:<\/p><ul><li>Wax Crayons<\/li><li>Bouncy Balls<\/li><li>Temporary Tattoo Sheets<\/li><li>Stretchy Toys<\/li><li>Bubble Tubs<\/li><li>Puzzle Books<\/li><li>Eraser Cubes<\/li><li>Maracas<\/li><li>Mini Bouncing Putty<\/li><li>Self Inflating Light Sticks<\/li><\/ul><p><strong>UNIQUE PARTY BAG FILLERS<\/strong><\/p><p>Get your party guests talking with our unique bag fillers! From novelty toys to funky games, we have options for all ages. We have thousands of fillers & favours to choose from so you can be sure to find something your guests will be surprised and entertained by. <\/p><p><strong>PARTY BAG TOYS<\/strong><\/p><p>Make your child's birthday party or play date even more memorable with our selection of party bag toys & fillers. Designed to bring laughter and joy, these toys are perfect for kids of all ages and interests. Whether your child loves dolls, action figures, puzzles, or crafts, we've got you covered with a wide range of options to choose from. <\/p><p>10 PARTY BAG TOY IDEAS:<\/p><ul><li>Bouncy Balls<\/li><li>Maracas<\/li><li>Moody Squeezy Faces<\/li><li>Puzzle Cubes<\/li><li>Bouncing Putty<\/li><li>Bubble Tubs<\/li><li>Stretchy Figures<\/li><li>Gliders<\/li><li>Putty Tubs<\/li><li>Slap Band Bracelets<\/li><\/ul><p><\/p><p><strong>CRAFT PARTY BAG FILLERS<\/strong><\/p><p>Every child loves to get crafty, and what better way to keep them entertained than with a craft activity kit in their party bags? From DIY craft kits to Make your own gliders, these kits are perfect for encouraging kids to use their imagination and have fun while they create something special to take home.<\/p><p>10 CRAFT FILLER IDEAS:<\/p><ul><li>Play Doh<\/li><li>Putty Tubs<\/li><li>Scratch Art<\/li><li>Stickers<\/li><li>Temporary Tattoos<\/li><li>MYO Princess Crown Kits<\/li><li>Brick Sets<\/li><li>DIY Bracelets<\/li><li>Puzzle Kits<\/li><li>Eco colouring sets<\/li><\/ul><p><\/p><p><strong>STATIONERY PARTY BAG FILLERS<\/strong><\/p><p>Our stationery bag fillers are the perfect addition to your next party! With a variety of fun and functional items to choose from, you'll be able to make every party a hit. From cute pens and pencils to colourful stickers and erasers, we have everything you need to fill your party bag and make your party guests smile. Plus, our stationery is made with high-quality materials making it the perfect party favor.<\/p><p>10 STATIONERY FILLER IDEAS:<\/p><ul><li>Wax Crayons<\/li><li>Pens & Pencils<\/li><li>Sticker Sheets<\/li><li>Puzzle Books<\/li><li>Eraser Cubes<\/li><li>Stationery Sets<\/li><li>Mini Colouring Books<\/li><li>Activity Sets<\/li><li>Mini Notebooks<\/li><li>Ink Stampers<\/li><\/ul><p><\/p><p><strong>PARTY BAG FUN & GAMES<\/strong><\/p><p>Get ready to have some serious fun with our party bag fun & games! Perfect for birthdays, parties and other special events. We have a variety of games and activities that will keep your little guests entertained and make your party bags the talk of the town. There's something for everyone.<\/p><ul><li>Jigsaw Puzzles<\/li><li>Self Inflating Light Sticks<\/li><li>Glow In The Dark Toys<\/li><li>Kazoo's<\/li><li>Spinning Tops<\/li><li>Mini Line-Up Game<\/li><li>Finger Traps<\/li><li>Groan Tubes<\/li><li>Springs & Slinkies<\/li><li>Party Hats<\/li><\/ul><p><\/p><p><strong>BOYS PARTY BAG FILLERS<\/strong><\/p><p>We have fun & affordable party bag favors for boys of all ages. From superhero figurines to mini toys you will find what your looking for on our store. When deciding what boys bag fillers to choose, consider popular boys party themes and activites to suit your event.<\/p><p><\/p><p><strong>GIRLS PARTY BAG FILLERS<\/strong><\/p><p>We have fun and exciting party bag favors for girls of all ages. Make your special occasion unforgettable designed to delight and entertain girls of all ages. From unicorn sketcher pads to DIY bracelets and accessories, our girls bag fillers will bring a smile to every girl's face.<\/p><p><\/p><p><strong>THEMED PARTY RANGES<\/strong><\/p><p>At KidsPartyCraft we have an extensive selection of children's party themes. Set the scene and transform your event into a lively celebration. You can get all your party supplies including tableware, decorations, party bags, games, bag fillers & favours all within your desired theme to ensure your party is unforgettable.<\/p><p>Our Themes:<\/p><ul><li>Unicorn<\/li><li>Dinosaur<\/li><li>Jungle<\/li><li>Superhero<\/li><li>Fairy<\/li><li>Mermaid<\/li><li>Farm<\/li><li>Pirate<\/li><li>Football<\/li><li>Princess<\/li><li>Bricks<\/li><li>Gamer<\/li><li>Sealife<\/li><li>Space<\/li><\/ul><p>We also have a variety of themes from popular brands & characters including Justice League, Harry Potter, LOL Surprise, Fortnite, Batman & more!<\/p><p><\/p><p><strong>ECO PARTY BAG FILLERS<\/strong><\/p><p>KidsPartyCraft is on a mission to become more sustainable and reduce our plastic waste. Take a look at our growing range of eco conscious and <a href=\"\/collections\/eco-party-bag-fillers\" title=\"Eco Party Bag Fillers\">eco friendly fillers<\/a>. We also have eco party bags which are made from sustainable materials and are entirely recyclable. Help support our mission towards a sustainable future.<\/p><p><\/p><p><strong>SHOP FOR CHEAP PARTY BAG FILLERS WITH KIDSPARTYCRAFT!<\/strong><\/p><p>Now that you have some inspiration from our extensive selection of bag fillers, favours, goodies & toys you can start your party plans and get the celebrations going. Kit out your party bags with KidsPartyCraft.<\/p><p><\/p><p><strong>KIDSPARTYCRAFT - THE UK'S MOST TRUSTED KIDS PARTY SUPPLIES STORE!<\/strong><\/p>","section_style":"section-blank","text_size":"medium","text_alignment":"","button_style":"btn--primary","button_label":"","button_link":""}}},"order":["collection-image","breadcrumbs","5bdd708d-325c-4bc6-8a22-7615d6c613f1","main","59949bf2-c225-4674-a47e-fe58def4ed54"]}